[
    {
        "text": "Had a great time speaking at the Arfa Karim Technology Incubator at National Aerospace Science & Technology Park (NASTP), as part of their Fellowship Program, an amazing initiative that’s giving our young generation the direction, skills, and exposure they truly need.\n\nI spoke about business, technology, and something we often overlook, communication. The reality is, a lack of communication skills is holding back so many talented individuals. Middlemen end up taking the credit, the money, and the opportunities, simply because they know how to present themselves better. Whether you’re in business, freelancing, or working on a startup, how you communicate can define how far you go.\n\nWhat stood out most to me was how clear-minded and focused these kids already are. That kind of clarity at this age is rare and honestly, it gives me a lot of hope.\nThis is where real change begins. The future looks bright and programs like this are helping shape it.",
        "likes": 1627,
        "comments": 101,
        "reposts": 7,
        "hashtags": "#IrfanMalik #xevensolutions #artificialintelligence #communicationskills #youthempowerment",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Technology",
            "Communication"
        ]
    },
    {
        "text": "Had a great time speaking at 30 under 30 by Connected Pakistan. Talking on the topic of 'Fail Fast, Learn Faster' felt so real because I’ve lived those lessons myself.\nLoved the energy in the room, so many young people eager to learn, ask questions, and push boundaries. \nEvents like this remind me how much potential our youth have to drive real change.\n\nAppreciate Connected Pakistan for this really meaningful initiative that will change many lives and produce many leaders!",
        "likes": 615,
        "comments": 30,
        "reposts": 3,
        "hashtags": "#IrfanMalik #xevensolutions #MuhammadIrfan #youthempowerment #artificialintelligence",
        "line_count": 4,
        "language": "English",
        "tags": [
            "30 Under 30",
            "Connected Pakistan"
        ]
    },
    {
        "text": "It was an honor to have dinner with Engr. Hafiz Naeem ur Rehman, a sincere leader dedicated to uplifting others, especially the younger generation. \nWe had a meaningful discussion on how technology and artificial intelligence can play a major role in youth empowerment. \nAs digital dependency grows, so does the need for collective action. \n\nEmpowering our youth demands strong collaboration and unity. The greater the challenge, the stronger our teamwork must be. \n\nInshallah, this meeting will lead to powerful change.\n\nYouth Digital Summit",
        "likes": 1302,
        "comments": 50,
        "reposts": 5,
        "hashtags": "#IrfanMalik #xevensolutions #MuhammadIrfan #ai #technology",
        "line_count": 5,
        "language": "English",
        "tags": [
            "Digital Summit"
        ]
    },
    {
        "text": "I talked about digital dependency and artificial intelligence at Youth Digital Summit – such a powerful event. \nWhenever I attend any event with Jamaat-e-Islami, I see discipline, courage, power, and energy. I truly see the strong character in youth. I loved the session and the environment. \n\nThank you very much for having me here today. Youth Digital Summit – you are doing amazing.",
        "likes": 537,
        "comments": 24,
        "reposts": 4,
        "hashtags": "#IrfanMalik #xevensolutions #aiwithirfanmalik #MuhammadIrfan #YouthDigitalSummit #DigitalPakistan #YouthEmpowerment",
        "line_count": 4,
        "language": "English",
        "tags": [
            "Jamaat E Islami",
            "Digital Summit"
        ]
    },
    {
        "text": "Islamabad gave me something I can’t fully put into words.\nIt wasn’t about the mic or the stage, it was about the people who truly want to do something for the future of this country. \nI saw young people carrying so much weight of uncertainty and pressure, yet still showing up with hope in their eyes. They weren’t looking for shortcuts, they were looking for direction, for meaning, for something real. And honestly, that touched me!\nIt reminded me that even in all the noise, there’s a generation quietly choosing growth.\n\nIslamabad, thank you for the love and respect.\n\nGrateful to have had Hisham Sarwar and Innovista alongside us in this. It’s always powerful when the right people come together for the right cause.",
        "likes": 806,
        "comments": 26,
        "reposts": 10,
        "hashtags": "#IrfanMalik #xevensolutions #aibaithak #aiwithirfanmalik #muhammadirfan #ai #youth",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "In a world that often feels too fast, too filtered, and too overwhelming, AI Baithak has become a space to slow down, speak up, and feel heard.\n\nAfter 3 meaningful sessions, AI Baithak Round 4 is here, a space not for lectures or applause, but for real people, real questions, and honest conversations.\nIt’s for anyone trying to figure things out, looking for direction, or just needing a space where their voice matters.\n\nThank you to Hisham Sarwar for being part of this journey and supporting a platform that’s all about listening, learning, and growing together.\nSee you there. Let’s talk.\n\n📅Date: 17th June, 2025\n⏰Time: 4PM\n📍Venue: InnoVista, 1st Avenue Mall, DHA 1, Rawalpindi",
        "likes": 379,
        "comments": 24,
        "reposts": 7,
        "hashtags": "#IrfanMalik #xevensolutions #artificialintelligence #aibaithak",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Innovista",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "Leadership is never a one-man show. It’s the courage to listen, the humility to ask, and the wisdom to surround yourself with people who challenge you to think better.\n\nGrateful to have a team that’s more like family. This picture captures a senior member of my team helping me brainstorm an innovative tech solution. Their experience, dedication, and honest feedback have shaped many of the decisions we’ve taken together over the years.\n\nInnovation becomes easier when you have the right people by your side.",
        "likes": 592,
        "comments": 25,
        "reposts": 2,
        "hashtags": "#IrfanMalik #xevensolutions #Teamwork #Leadership #Innovation #Gratitude #TechJourney",
        "line_count": 9,
        "language": "English",
        "tags": [
            "Innovation",
            "Leadership"
        ]
    },
    {
        "text": "Turning an idea into reality demands continuous research and consistent implementation. \nSuccess doesn’t come from inspiration alone. It’s the result of learning, adapting, and taking action every day. The more you explore and apply, the closer you move to your goal. \n\nProgress lives in persistence, not perfection.",
        "likes": 703,
        "comments": 27,
        "reposts": 1,
        "hashtags": "#IrfanMalik #xevensolutions #AIinHealthcare #qatar",
        "line_count": 4,
        "language": "English",
        "tags": [
            "Productivity",
            "Motivation"
        ]
    },
    {
        "text": "Visiting Trauma Care Qatar alongside the Surgeon General of Pakistan, Col. Farrukh, and Maj. Javed to explore and establish strategic collaboration in AI and healthcare between Pakistan and Qatar. \n\nArtificial Intelligence has the potential to revolutionize patient care, streamline clinical operations, and introduce data-driven innovations that save lives. Together, we are working towards a future where healthcare is smarter, faster, and more accessible for all.\n\n📍Hamad General Hospital - Trauma & Emergency, Doha, Qatar",
        "likes": 355,
        "comments": 11,
        "reposts": 4,
        "hashtags": "#IrfanMalik #xevensolutions #AIinHealthcare #Pakistan #qatar",
        "line_count": 3,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Healthcare"
        ]
    },
    {
        "text": "The collaboration between Pakistan and Qatar in healthcare and artificial intelligence holds great promise for impactful progress in both countries. \nPakistan brings strong technological expertise and problem-solving capabilities, while Qatar is making significant investments in this sector. \n\nHats off to Atlantic International Business Network (AIBN) for facilitating such meaningful partnerships that will open new opportunities for our youth and healthcare innovators.",
        "likes": 689,
        "comments": 37,
        "reposts": 7,
        "hashtags": "#IrfanMalik #xevensolutions #AIinHealthcare #qatar #Pakistan",
        "line_count": 3,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Healthcare"
        ]
    },
    {
        "text": "It was an unforgettable day by the grace of Almighty. When Allah chose me to represent my country, placed knowledge in my heart, and gave words to my mouth to make Pakistan proud. \nIt truly was an amazing day where I had the opportunity to show the world the talent we have, the abilities of our youth, and the passion that drives them. I was proud to present what Pakistan is truly capable of in the field of technology.\n\nOn that stage, I saw something powerful, people from around the world were proud of our country. They recognized the potential of Pakistan in technology, innovation, and ventures.\n\nThank you to the Pakistan Ambassador and Atlantic International Business Network (AIBN) for organizing such an incredible collaborative event.",
        "likes": 465,
        "comments": 22,
        "reposts": 3,
        "hashtags": "#IrfanMalik #xevensolutions #AIinHealthcare #pakistan #qatar #artificialintelligence",
        "line_count": 5,
        "language": "English",
        "tags": [
            "Technology",
            "Pakistan"
        ]
    },
    {
        "text": "Honored to be invited by the Ambassador of Pakistan, Mr. Muhammad Aamer, to a special dinner hosted for Pakistani leaders at the Diplomatic Club, Qatar.\n\nGrateful to represent my country among inspiring individuals working towards innovation, collaboration, and global impact.\n\nMay Allah continue to bless Pakistan with growth and unity. 🇵🇰",
        "likes": 2220,
        "comments": 100,
        "reposts": 9,
        "hashtags": "#IrfanMalik #xevensolutions #AI #AIinHealthcare #Pakistan #qatar",
        "line_count": 3,
        "language": "English",
        "tags": [
            "Qatar",
            "Pakistan"
        ]
    },
    {
        "text": "Honored to be part of the distinguished panel at the Pakistan Healthcare Solutions Conference in Doha, Qatar, discussing the future of smart healthcare innovations powered by AI, IoT, and digital transformation.\n\nLooking forward to meaningful discussions on how technology can improve healthcare access, drive better outcomes, and create new opportunities for collaboration between Pakistan and Qatar.\n\n📅Date: 2nd June, 25\n📍Location: ITQAN, Doha, Qatar\n⏰Time: 11:45 AM (Doha Time)",
        "likes": 209,
        "comments": 15,
        "reposts": 3,
        "hashtags": "#IrfanMalik #xevensolutions #HealthcareInnovation #AI #Pakistan #qatar",
        "line_count": 4,
        "language": "English",
        "tags": [
            "Internet Of Things",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "Honored to stand alongside proud Pakistani leaders in Qatar, representing our country in healthcare and AI innovation:\n\nMr. Ikram Ul Haq – President, Chamber of Commerce\nMr. Khawaja Masood – Chairman, Forward Group\nMr. Yasir Bucha – CEO, Buch International Hospital\nMr. Hafiz Muhammad Talha – CEO/MD, AIBN\nColonel Farrukh Javed – COO, AIBN\nBrigadier Nazir sb\n\nTogether, we carry the spirit of Pakistan to the global stage.",
        "likes": 474,
        "comments": 19,
        "reposts": 3,
        "hashtags": "#IrfanMalik #xevensolutions #Pakistan #Qatar #HealthcareInnovation #AI #ProudPakistani",
        "line_count": 8,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Healthcare"
        ]
    },
    {
        "text": "Informal meet-up today at ITQAN Innovation & Simulation Center, Qatar as we are gearing up for tomorrow’s Pakistan Healthcare Solution Conference.\n\nInshaAllah, I’ll be presenting our very own healthcare innovation with high hopes and full trust in Allah.\n\nLet’s inspire, let’s innovate.",
        "likes": 510,
        "comments": 30,
        "reposts": 6,
        "hashtags": "#IrfanMalik #xevensolutions #AIinHealthcare #qatar",
        "line_count": 3,
        "language": "English",
        "tags": [
            "Itqan Innovation Center",
            "Healthcare"
        ]
    },
    {
        "text": "It was a good experience speaking at the Tech & Entrepreneur Summit 2.0 organised by Future Synergy, powered by Innovista.\n\nIt’s great to see the youth so focused on shaping the future of technology and entrepreneurship. I’m optimistic about the opportunities ahead as we \ncontinue to innovate and push boundaries.\n\nHere’s to a future built on vision and effort!",
        "likes": 887,
        "comments": 54,
        "reposts": 13,
        "hashtags": "#IrfanMalik #xevensolutions #aiwithirfanmalik #MuhammadIrfan #artificialintelligence #youthempowerment",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Entrepreneurship",
            "Technology"
        ]
    },
    {
        "text": "Xeven Solutions is proud to announce a major step forward in healthcare automation! \nBuch International Hospital, a two-time winner of the Technology Innovation of the Year award, is now embracing full AI automation. \n\nThis collaboration is a game-changer, and we’re grateful to Yasir Bucha for leading the way in adopting cutting-edge solutions. \n\nA new era in healthcare begins!",
        "likes": 715,
        "comments": 69,
        "reposts": 8,
        "hashtags": "#IrfanMalik #xevensolutions #artificialintelligence #AIinHealthcare #AIautomation",
        "line_count": 4,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Healthcare"
        ]
    },
    {
        "text": "The world is changing fast, especially in our country. Now more than ever, we need to shift our mindset from looking for jobs to searching for ideas, from doing projects to building products. \nInstead of just expanding, we need to focus on innovation. It’s not about learning more skills, but about learning the right skills and adding creativity to them.\n\nThank you so much, Hassan Raza & TechTitans Pakistan, for organizing another great event. You’re doing an excellent job of uplifting the community and adding real value!",
        "likes": 663,
        "comments": 46,
        "reposts": 9,
        "hashtags": "#IrfanMalik #xevensolutions #aiwithirfanmalik #artificialintelligence",
        "line_count": 5,
        "language": "English",
        "tags": [
            "Innovation",
            "Tech Titans"
        ]
    },
    {
        "text": "Young minds today show up curious, stay eager to grow, and never back down from a challenge.\nThis generation isn’t just learning, they’re building, asking questions, and stepping into the future with strong intentions and a vision for something better.\n\nThat’s why Awfera is proud to support their journey through real-world insights, meaningful mentorship, and the kind of guidance that truly makes a difference.\n\nSaqib Azhar, thank you for joining us and sharing your valuable perspective. \n\n-AI Baithak 3\n\nXeven Solutions",
        "likes": 1068,
        "comments": 60,
        "reposts": 12,
        "hashtags": "#IrfanMalik #xevensolutions #aiwithirfanmalik #MuhammadIrfan #artificialintelligence #awferameetup",
        "line_count": 5,
        "language": "English",
        "tags": [
            "Xeven Solutions",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "No company is ever successful without the dedication and hard work of its team. Today, we are here to celebrate that.\n\nIt was such a meaningful day, celebrating the people who make everything possible. This wasn’t just about awards or applause it was about appreciating the everyday efforts, the quiet dedication, and the teamwork that keeps us moving forward. \nNone of this happens without each other! \n\n-Second Employee Appreciation Ceremony’25\n\nXeven Solutions",
        "likes": 875,
        "comments": 27,
        "reposts": 6,
        "hashtags": "#IrfanMalik #xevensolutions #EmployeeAppreciationDay #teamwork",
        "line_count": 6,
        "language": "English",
        "tags": [
            "Employee Appreciation",
            "Xeven Solutions"
        ]
    }
]